In [1]:
# Pandas | Series

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
labels = ['a','b','c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a':10, 'b': 20, 'c':30}

In [5]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [8]:
series1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'South Afirca', 'Japan'])

In [9]:
series1

USA             1
Germany         2
South Afirca    3
Japan           4
dtype: int64

In [10]:
series2 = pd.Series([14,23,10,4], ['USA', 'Germany', 'South Afirca', 'Japan'])

In [11]:
series2

USA             14
Germany         23
South Afirca    10
Japan            4
dtype: int64

In [12]:
series1 + series2

USA             15
Germany         25
South Afirca    13
Japan            8
dtype: int64

In [13]:
series3 = pd.Series([1,2,69,4], ['USA', 'Germany', 'New London', 'Japan'])

In [14]:
series3 + series2

Germany         25.0
Japan            8.0
New London       NaN
South Afirca     NaN
USA             15.0
dtype: float64

In [15]:
# pd || DataFrames

In [16]:
from numpy.random import randn

In [17]:
np.random.seed(101)

In [18]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y', 'Z'])

In [19]:
# bunch of series with the same key's
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
# Series -> (somewhat a ) dict
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [21]:
df['new'] = 2.0

In [22]:
df

          W         X         Y         Z  new
A  2.706850  0.628133  0.907969  0.503826  2.0
B  0.651118 -0.319318 -0.848077  0.605965  2.0
C -2.018168  0.740122  0.528813 -0.589001  2.0
D  0.188695 -0.758872 -0.933237  0.955057  2.0
E  0.190794  1.978757  2.605967  0.683509  2.0

In [23]:
df['sum'] = df['W'] + df['X'] + df['Y']  + df['Z'] + df['new']

In [24]:
df

          W         X         Y         Z  new       sum
A  2.706850  0.628133  0.907969  0.503826  2.0  6.746778
B  0.651118 -0.319318 -0.848077  0.605965  2.0  2.089688
C -2.018168  0.740122  0.528813 -0.589001  2.0  0.661767
D  0.188695 -0.758872 -0.933237  0.955057  2.0  1.451643
E  0.190794  1.978757  2.605967  0.683509  2.0  7.459028

In [25]:
df.drop('new', axis=1)

          W         X         Y         Z       sum
A  2.706850  0.628133  0.907969  0.503826  6.746778
B  0.651118 -0.319318 -0.848077  0.605965  2.089688
C -2.018168  0.740122  0.528813 -0.589001  0.661767
D  0.188695 -0.758872 -0.933237  0.955057  1.451643
E  0.190794  1.978757  2.605967  0.683509  7.459028

In [26]:
df.drop('new', axis =1)

          W         X         Y         Z       sum
A  2.706850  0.628133  0.907969  0.503826  6.746778
B  0.651118 -0.319318 -0.848077  0.605965  2.089688
C -2.018168  0.740122  0.528813 -0.589001  0.661767
D  0.188695 -0.758872 -0.933237  0.955057  1.451643
E  0.190794  1.978757  2.605967  0.683509  7.459028

In [27]:
df.drop('E')

          W         X         Y         Z  new       sum
A  2.706850  0.628133  0.907969  0.503826  2.0  6.746778
B  0.651118 -0.319318 -0.848077  0.605965  2.0  2.089688
C -2.018168  0.740122  0.528813 -0.589001  2.0  0.661767
D  0.188695 -0.758872 -0.933237  0.955057  2.0  1.451643

In [28]:
# col : axis = 1, row : axis = 0

In [29]:
# rows are series if called with loc
df.loc['A']

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    2.000000
sum    6.746778
Name: A, dtype: float64

In [30]:
df.iloc[0]

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    2.000000
sum    6.746778
Name: A, dtype: float64

In [31]:
# df.iloc[0] == df.loc['A']

In [32]:
df.loc['B', 'Y']

-0.8480769834036315

In [33]:
# ez indexing
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [34]:
# Pandas || more Dataframes